################################################################################
#  Brew Taps
################################################################################
tap 'homebrew/dupes'
tap 'homebrew/fuse'
tap 'homebrew/homebrew-php'
tap 'homebrew/homebrew-services'
tap 'homebrew/versions'
tap 'neovim/neovim'

################################################################################
#  Brew Casks
################################################################################
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'iterm2'
cask 'java'
cask 'osxfuse'
cask 'postman'
cask 'sequel-pro'

################################################################################
#  Brew Packages
################################################################################
brew 'ack'
brew 'ag'
brew 'composer'
brew 'coreutils'
brew 'ctags'
brew 'emacs', args: ['with-cocoa']
brew 'fontconfig'
brew 'htop'
brew 'https://raw.github.com/apiaryio/drafter/master/tools/homebrew/drafter.rb', args: ['HEAD']
brew 'imagemagick'
brew 'leiningen'
brew 'mpc'
brew 'mpd'
brew 'mplayer'
brew 'mycli'
brew 'mysql'
brew 'ncmpcpp'
brew 'neovim'
brew 'php70'
brew 'php70-imagick'
brew 'php70-mcrypt'
brew 'php70-pdo-dblib'
brew 'php70-pdo-pgsql'
brew 'php70-redis'
brew 'php70-xdebug'
brew 'php71'
brew 'php71-imagick'
brew 'php71-mcrypt'
brew 'php71-pdo-dblib'
brew 'php71-pdo-pgsql'
brew 'php71-redis'
brew 'php71-xdebug'
brew 'plantuml'
brew 'postgresql'
brew 'pwgen'
brew 'python'
brew 'python3'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ripgrep'
brew 'rsync'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'sshfs'
brew 'stow'
brew 'supervisor'
brew 'tmux'
brew 'wget'
brew 'yarn'
brew 'zsh'
