################################################################################
#  Brew Taps
################################################################################
tap 'homebrew/dupes'
tap 'homebrew/fuse'
tap 'homebrew/homebrew-php'
tap 'homebrew/homebrew-services'
tap 'homebrew/versions'
tap 'neovim/neovim'

################################################################################
#  Brew Casks
################################################################################
# others are dependent on these
cask 'java'
cask 'osxfuse'
cask 'xquartz'

cask 'android-platform-tools'
cask 'docker'
cask 'dropbox'
cask 'eclipse-ide'
cask 'firefox'
cask 'haskell-platform'
cask 'inkscape'
cask 'iterm2-beta'
cask 'mactex'
cask 'postman'
cask 'robomongo'
cask 'sequel-pro'
cask 'vagrant'
cask 'virtualbox'

################################################################################
#  Brew Packages
################################################################################
brew 'ack'
brew 'ag'
brew 'asciinema'
brew 'composer'
brew 'coreutils'
brew 'ctags'
brew 'editorconfig'
brew 'elixir'
brew 'emacs', args: ['with-cocoa']
brew 'fontconfig'
brew 'gcc', args: ['enable-cxx']
brew 'global'
brew 'gradle'
brew 'htop'
brew 'https://raw.github.com/apiaryio/drafter/master/tools/homebrew/drafter.rb', args: ['HEAD']
brew 'imagemagick'
brew 'koekeishiya/formulae/khd'
brew 'leiningen'
brew 'llvm', args: ['with-toolchain']
brew 'maven'
brew 'mpc'
brew 'mpd'
brew 'mplayer'
brew 'mycli'
brew 'mysql'
brew 'ncmpcpp'
brew 'neovim'
brew 'nginx'
brew 'php56'
brew 'php56-imagick'
brew 'php56-mcrypt'
brew 'php56-pdo-dblib'
brew 'php56-pdo-pgsql'
brew 'php56-redis'
brew 'php56-xdebug'
brew 'php70'
brew 'php70-imagick'
brew 'php70-mcrypt'
brew 'php70-pdo-dblib'
brew 'php70-pdo-pgsql'
brew 'php70-redis'
brew 'php70-xdebug'
brew 'php71'
brew 'php71-imagick'
brew 'php71-mcrypt'
brew 'php71-pdo-dblib'
brew 'php71-pdo-pgsql'
brew 'php71-redis'
brew 'php71-xdebug'
brew 'plantuml'
brew 'postgresql'
brew 'pwgen'
brew 'python'
brew 'python3'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ripgrep'
brew 'rsync'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'sshfs'
brew 'stow'
brew 'supervisor'
brew 'tmux'
brew 'wget'
brew 'yarn'
brew 'zsh'
