tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'homebrew/homebrew-php'
tap 'neovim/neovim'

brew 'ack'
brew 'ag'
brew 'composer'
brew 'coreutils'
brew 'ctags'
brew 'fontconfig'
brew 'htop'
brew 'imagemagick'
brew 'mpd'
brew 'mplayer'
brew 'mycli'
brew 'mysql'
brew 'ncmpcpp'
brew 'neovim'
brew 'php71'
brew 'php71-imagick'
brew 'php71-mcrypt'
brew 'php71-pdo-dblib'
brew 'php71-pdo-pgsql'
brew 'php71-redis'
brew 'php71-xdebug'
brew 'plantuml'
brew 'postgresql'
brew 'pwgen'
brew 'python'
brew 'python3'
brew 'reattach-to-user-namespace'
brew 'redis'
brew 'ripgrep'
brew 'sqlite'
brew 'supervisor'
brew 'stow'
brew 'tmux'
brew 'wget'
brew 'zsh'


cask 'iterm2'
cask 'java'
cask 'sequel-pro'
